posts/Linux/2016-08-05-Android-without-Google.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-04 Thu 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Get rid of Google</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="How to use your phone without Google applications"
 />
<meta name="keywords" content="Android, Google, APKPure" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Get rid of Google</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdaf33d2">Cyanogenmod without Open GApps</a></li>
<li><a href="#org841c6d0">Application management</a></li>
<li><a href="#org2f73074">Contact and calendar</a></li>
<li><a href="#orgd249a10">Replacement of Google applications</a>
<ul>
<li><a href="#org65b4e67">microG</a>
<ul>
<li><a href="#orgfd62c42">Installation of Haystack</a></li>
<li><a href="#orgd25da72">Installation of Xposed</a></li>
<li><a href="#orgb6f9d62">Installation of microG Services Core</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf13c6fe">Conclusion</a></li>
</ul>
</div>
</div>
<p>
I like a lot of stuff that Google is doing, especially that it
supports open source.  However, I really dislike their attitude
towards user privacy.  That is why I decided to get rid of Google on
my Android phone.  However, I had to solve some problems in order to
keep user-friendliness at a high level and to be able to use all
applications that I need.
</p>

<p>
The main issues are:
</p>
<ol class="org-ol">
<li>Which <a href="#orgdaf33d2">ROM</a> do I use?</li>
<li>How do I <a href="#org841c6d0">install software</a> and keep it up to date?</li>
<li>How do I synchronize all my <a href="#org2f73074">contacts and calendar</a>?</li>
<li>Can I <a href="#orgd249a10">replace applications</a> that do not run without Google Play
Services?</li>
</ol>

<p>
The answers are:
</p>
<div id="outline-container-orgdaf33d2" class="outline-2">
<h2 id="orgdaf33d2"><a id="ID-355d5345-87bf-4f4f-b10f-4447b4b25c3e"></a>Cyanogenmod without Open GApps</h2>
<div class="outline-text-2" id="text-orgdaf33d2">
<p>
I have been using <a href="http://www.cyanogenmod.org/">Cyanogenmod</a> for quite some time now and I am very
happy with it.  After a complete backup, I formatted every possible
partition on my phone and did a clean reinstall without Open GApps.
This left me with a Google-less Android install.
</p>
</div>
</div>

<div id="outline-container-org841c6d0" class="outline-2">
<h2 id="org841c6d0"><a id="ID-1e6ca9e5-e19d-4fb3-8c25-d43f42beb9c5"></a>Application management</h2>
<div class="outline-text-2" id="text-org841c6d0">
<p>
Use <a href="https://f-droid.org/">F-Droid</a>.  For applications that are not available in F-Droid, use
a <i>service</i> that provides APK files of Google Play Store applications.
</p>

<p>
This is the main drawback, because this <i>service</i> has to be trusted in
that it does not alter the APK files in any way.  I decided to use
<a href="https://apkpure.com/">APKPure</a> because it comes with an application that can update all
installed applications.  I compared the <code>md5</code> check sums of randomly
chosen APK files from <i>APKPure</i> with the one from the Google Play
Store and could not find any differences.  This problem of completely
trusting an unknown organization is still bugging me but I did not
find another solution so far (especially because all application
stores are incomplete).
</p>
</div>
</div>

<div id="outline-container-org2f73074" class="outline-2">
<h2 id="org2f73074"><a id="ID-103c56e4-2de5-450f-b550-26ee223922a7"></a>Contact and calendar</h2>
<div class="outline-text-2" id="text-org2f73074">
<p>
For contact and calendar synchronization, I use a Raspberry Pi with
<a href="https://nextcloud.com/">Nextcloud</a> (or <a href="https://owncloud.org/">Owncloud</a>) together with <a href="https://davdroid.bitfire.at/">DavDroid</a> on the phone (which is
available on F-Droid).  I am sure there are other services available
that do not require an extensive server setup like this one.
</p>
</div>
</div>

<div id="outline-container-orgd249a10" class="outline-2">
<h2 id="orgd249a10"><a id="ID-be47bed7-3ded-448c-83a6-920269a66a1d"></a>Replacement of Google applications</h2>
<div class="outline-text-2" id="text-orgd249a10">
<p>
I replaced Google Maps with OsmAnd; Gmail with the native Android mail
client; I never used Google Now nor Hangouts nor any other Google
application.  
</p>

<p>
So far, this was way easier than I thought.  Ironically, a local
application that provides information about public transport was the
only one that complained about Google Play Services being
non-existent.  That's when I dived into this issue and found <a href="https://microg.org/">microG</a>,
an open source library that provides replacements for a lot of
functions usually provided by Google Play Services.
</p>
</div>

<div id="outline-container-org65b4e67" class="outline-3">
<h3 id="org65b4e67"><a id="ID-0baa317a-239a-4fd8-a652-3014ec1f35cb"></a>microG</h3>
<div class="outline-text-3" id="text-org65b4e67">
<p>
The setup on Cyanogenmod with Android 6.0.1 is tough because system
spoofing needs to be available.  This can be done using Haystack or
Xposed (do not follow both instruction sets).
</p>
</div>

<div id="outline-container-orgfd62c42" class="outline-4">
<h4 id="orgfd62c42">Installation of Haystack</h4>
<div class="outline-text-4" id="text-orgfd62c42">
<p>
A detailed explanation can be found on the <a href="https://github.com/Lanchon/haystack">GitHub page</a>.
</p>
</div>
</div>

<div id="outline-container-orgd25da72" class="outline-4">
<h4 id="orgd25da72">Installation of Xposed</h4>
<div class="outline-text-4" id="text-orgd25da72">
<ul class="org-ul">
<li>With F-Droid, install Xposed Downloader.</li>
<li>With Xposed Downloader, download the latest Xposed framework and the Xposed
Installer.</li>
<li>In Recovery mode, install the latest Xposed framework (always wipe
cache).</li>
<li>Wipe cache and reboot; check if the Xposed framework is working
correctly (start Xposed installer).</li>
<li>With Xposed, download FakeGApps and activate it; reboot.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6f9d62" class="outline-4">
<h4 id="orgb6f9d62">Installation of microG Services Core</h4>
<div class="outline-text-4" id="text-orgb6f9d62">
<ul class="org-ul">
<li>With F-Droid, activate the <a href="https://microg.org/fdroid.html">microG repository</a>.</li>
<li>With F-Droid, install microG Services Core, microG Services
Framework and a network location backend (e.g., MozillaNlpbackend).</li>
<li>With microG, open settings and check if spoofing support is enabled
(Self-Check).</li>
<li>With microG, enable everything and also the network location
provider backend.</li>
<li>And yea, it works!</li>
<li>If you have installed applications that use Google Cloud Messaging
(like <a href="https://whispersystems.org/">Signal</a>) before, you have to either reinstall them, or
re-register to the Google servers, otherwise message delivery may be
delayed.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf13c6fe" class="outline-2">
<h2 id="orgf13c6fe"><a id="ID-a453e579-13e4-482d-9683-e1a26cd5db6a"></a>Conclusion</h2>
<div class="outline-text-2" id="text-orgf13c6fe">
<p>
Installing Android without Google Play Services was way easier than I
thought.  However, to enable applications that require certain
features like the messaging or the location interface of Google Play
Services, extensive tinkering is necessary.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(Get rid of Google)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><p>Copyright 2015-2018 Dominik Schrempf</p>
<p>Last updated <span class="timestamp-wrapper"><span class="timestamp">2018-01-04</span></span></p>
<p>Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.1.6) </p>
<p><a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML</p>
</div>
</div>
</body>
</html>
